app/views/parts/show.html.erb

SELECT "cars".* FROM "cars" INNER JOIN "cars_parts" ON "cars"."id" = "cars_parts"."car_id" WHERE "cars_parts"."part_id" = ?  [["part_id", 4]]
---
<ul>
  <% @part.cars.each do |car| %>