app/views/makes/show.html.erb

SELECT "cars".* FROM "cars" WHERE "cars"."make_id" = ?  [["make_id", 1]]
---
<ul>
  <% @make.cars.each do |car| %>