app/controllers/cars_controller.rb

  def new
    @car = Car.new
    @parts = Part.all
---
SELECT "parts".* FROM "parts"

  def edit
    @parts = Part.all
---
SELECT "parts".* FROM "parts" WHERE 1=0

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("name", "vin", "make_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdf"], ["vin", 1234567890], ["make_id", 1], ["created_at", "2019-11-25 01:23:00.583384"], ["updated_at", "2019-11-25 01:23:00.583384"]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "name" = ?, "vin" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["name", "test"], ["vin", 1234567890], ["updated_at", "2019-10-22 20:37:06.279593"], ["id", 9]]

  def destroy
    @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 10]]

  def search
    @cars = Car
      .joins(:make)
      .where("cars.name like :search OR vin like :search OR makes.name like :search", search: "%#{params[:query]}%")
---
SELECT "cars".* FROM "cars" INNER JOIN "makes" ON "makes"."id" = "cars"."make_id" WHERE (name like '%camry%' OR vin like '%camry%' OR makes.name like '%camry%')

    def set_car
      @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]