app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts"
---
  def index
    @parts = Part.all

INSERT INTO "parts" ("name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "brake light"], ["quantity", 0], ["created_at", "2019-11-21 20:51:03.736444"], ["updated_at", "2019-11-21 20:51:03.736444"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

UPDATE "parts" SET "quantity" = ?, "updated_at" = ? WHERE "parts"."id" = ?  [["quantity", 3], ["updated_at", "2019-11-21 20:51:30.719625"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @part.update(part_params)

DELETE FROM "cars_parts" WHERE "cars_parts"."part_id" = ?  [["part_id", 980190962]]
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 980190962]]
---
  def destroy
    @part.destroy

SELECT "parts".* FROM "parts" WHERE (name like '%windshield%')
---
  def search
    @parts = Part.where("name like ?", "%#{params[:query]}%")

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_part
      @part = Part.find(params[:id])