app/views/cars/_form.html.erb

    <%= form.label :make_id %>
    <%= form.collection_select :make_id, Make.all, :id, :name %>
---
SELECT "makes".* FROM "makes"

    <%= form.label :part_id %>
    <%= form.collection_check_boxes :part_ids, Part.all, :id, :name %>
---
SELECT "parts".* FROM "parts"