app/views/cars/index.html.erb

SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 1]]
---
        <td><%= car.make.name %></td>
        <td><ul><% car.parts.each do |part| %>