app/views/cars/show.html.erb

<ul>
  <% @car.parts.each do |part| %>
---
SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 4]]